Ex10/conf/app/controllers/library_controller.rb

  def index
    @articles = Article.order(:title)
---
SELECT "articles".* FROM "articles" ORDER BY "articles"."title" ASC