Ex8/conf/app/controllers/articles_controller.rb

INSERT INTO "articles" ("name", "affiliation", "contact", "phone", "title", "abstract", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "abstract" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["abstract", "This is the Exercise 7 Problem 2. Abstract of sample article.\r\nEdit it and UPDATE!"], ["updated_at", "2018-07-09 07:20:13.373514"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)